# coding: utf8

import re
import urllib2

skills = {
    'C、'    : 0,
    'C/'     : 0,
    'c++'    : 0,
    'mysql'  : 0,
    'tcp/ip' : 0,
    'cdn'    : 0,
    'linux'   : 0,
    'javascript' : 0,
    'html'    : 0,
    'nosql'   : 0,
    'hadoop'  : 0,
    'spark'   : 0,
    'storm'   : 0,
    'lbs'     : 0,
    '经验'    : 0,
    '架构'    : 0,
    '容灾'    : 0,
    '优化'    : 0,
    '重构'    : 0,
    '稳定'    : 0,
    '沟通'    : 0,
    '压力'    : 0,
    '主动'    : 0,
    '好学'    : 0,
    '分布式'  : 0,
    '云计算'  : 0,
    '互联网'  : 0, 
    '数据库'  : 0,   
    '流媒体'  : 0,
    '富媒体'  : 0,
    '高性能'  : 0,
    '高可靠'  : 0,    
    '高并发'  : 0,
    '大数据'  : 0,
    '海量数据': 0,
    '网络处理': 0,
    '存储架构': 0
    '数据处理': 0,
    '精通C++' : 0,
    '安全逻辑': 0,
    '通信系统': 0,
    '面向对象': 0,
    '操作系统': 0,
    '软件工程': 0,
    '设计模式': 0,
    '数据结构': 0,
    '网络安全': 0,
    '安全漏洞': 0,
    '网络攻击': 0,
    '网络开发': 0,
    '数据分析': 0,
    '逻辑思维': 0,
    '实时计算': 0,
    '实时推荐': 0,
    '分布式计算' : 0,
    '大容量网络' : 0,
    '大容量通信' : 0,
    '进程间通讯' : 0,
    '后台业务开发' : 0,
    '计算机基础结构' : 0,
    '互联网应用协议' : 0
     }

html = urllib2.urlopen('http://hr.tencent.com/position_detail.php?id=15013&keywords=SNG%20%E5%90%8E%E5%8F%B0&tid=0&lid=2218').read()

#print html.lower()
print type(html)
print 'debug--------'
print html.lower().find('c/c++')

